app/controllers/add_flights_controller.rb

SELECT "add_flights".* FROM "add_flights"
---
  def index
    @add_flights = AddFlight.all

INSERT INTO "add_flights" ("departing", "arriving", "departureTime", "arrivalTime", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @add_flight = AddFlight.new(add_flight_params)

    respond_to do |format|
      if @add_flight.save

DELETE FROM "add_flights" WHERE "add_flights"."id" = ?  [["id", 1]]
---
  def destroy
    @add_flight.destroy

SELECT  "add_flights".* FROM "add_flights" WHERE "add_flights"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_add_flight
      @add_flight = AddFlight.find(params[:id])